In [1]:
import pandas as pd

In [40]:
# !pip install openpyxl
# !pip install sqlalchemy

### EXCEL

In [47]:
df = pd.read_excel('./execel_sample.xlsx', sheet_name="Sheet1")
df

   Roll no    Name  Age
0       32   Ahmed   18
1       45  Yousuf   22
2       28  Yaseen   23
3       65  Ismail   19

In [19]:
df.to_excel('new_excel_sample.xlsx', 
            sheet_name='Sheet1', index=False)

### CSV

In [29]:
df = pd.read_csv('csv_sample.csv')
df

   Roll no    Name  Age
0       32   Ahmed   18
1       45  Yousuf   22
2       28  Yaseen   23
3       65  Ismail   19

In [30]:
df.to_csv('new_csv_sample.csv', index=False)

### HTML

In [32]:
df = pd.read_html('https://www.espncricinfo.com/newzealand/content/player/226492.html')
df[0]

,Unnamed: 0,Mat,Inns,NO,Runs,HS,Ave,BF,SR,100,50,4s,6s,Ct,St
0,Tests,47,89,1,2586,189,29.38,5548,46.61,3,17,326,23,50,0
1,ODIs,186,183,19,6927,237*,42.23,7896,87.72,16,37,702,181,93,0
2,T20Is,101,97,7,2895,105,32.16,2129,135.97,2,17,255,142,58,0
3,First-class,115,208,13,7389,227,37.89,13776,53.63,16,39,980,92,130,0
4,List A,250,245,22,9525,237*,42.71,10868,87.64,27,47,977,243,127,0
5,T20s,270,261,23,7713,120*,32.40,5883,131.10,4,48,666,355,162,0

In [34]:
df[0].to_html('html_sample.html')

### SQL

In [43]:
from sqlalchemy import create_engine

In [45]:
engine = create_engine('sqlite:///:memory:')

In [48]:
df.to_sql('new_table', engine)

In [52]:
pd.read_sql(sql='new_table', con=engine)

   index  Roll no    Name  Age
0      0       32   Ahmed   18
1      1       45  Yousuf   22
2      2       28  Yaseen   23
3      3       65  Ismail   19